// Суть: Внутри банка лежит объект clients, где ключи — имена (строки), а значения — баланс (числа).
// Нужно реализовать методы:

// addUser(name, balance) — добавляет нового клиента (если имя уже есть — не перезаписывать, а вывести "Уже есть").

// getTotalMoney() — возвращает сумму всех денег в банке.

// getAverageBalance() — возвращает средний баланс (если клиентов нет — вернуть 0).


// Код проверки

bank.addUser("Алиса", 500);
bank.addUser("Боб", 300);
bank.addUser("Алиса", 1000); // Должен сказать "Уже есть"

console.log("Всего денег в банке: " + bank.getTotalMoney()); // 800
console.log("Средний баланс: " + bank.getAverageBalance());   // 400
