
a = {
    "message": "ссылка на картинку",
    "status": "Success"
}

console.log(a)

// async - метка у функции "внутри меня будет запрос по интернету"
async function getDog() {
    // await - дождаться окончания асинхронной операции (например ответа от сервера), и пока не придет ответ не бежать дальше
    // ответ на запрос на адрес в скобках
    const response = await fetch('https://dog.ceo/api/breeds/image/random')

    // распаковка http-ответа в обычный js-объект
    const data = await response.json()

    // выводим поле объекта с именем message
    console.log(data)
}

getDog()

// Домашнее задание
// Написать простую страницу html с одной кнопкой "создать собаку"
// добавить обработчик событий на кнопку - вызов функции getDog и отображение новой собаки на сайте
// каждый раз когджа нажимается кнопка - собака меняется
